/* ----------------------------------------------
/* 2.11.1 - Композиція класів / CSS-модулі
/* ----------------------------------------------
Створимо CSS-модуль для стилізації компонента в Alert.module.css 
та імпортуємо в Alert.tsx:
-------------------------
css.alert – базовий стиль (використовується завжди)
Якщо передано type="success", додасться клас css.success
Якщо type="error" – буде css.error
Якщо type не передано – буде лише базовий стиль
/* ----------------------------------------------*/
// Приклад Alert.tsx
/* ----------------------------------------------*/
// import clsx from 'clsx';
// import css from './Alert.module.css';
// interface AlertProps {
//   type?: 'success' | 'error';
//   message: string;
// }
// export default function Alert({ type, message }: AlertProps) {
//   return <p className={clsx(css.alert, type && css[type])}>{message}</p>;
/* ----------------------------------------------*/
// Приклад використання Alert.tsx в App.tsx
// ------------------------------------------------
// import Alert from "./Alert";
// export default function App() {
//   return (
//     <>
//       <Alert />
//       <Alert type="success"  />
//       <Alert type="error" />
//     </>
//   );
// }
/* ----------------------------------------------*/

import clsx from "clsx";
import css from "./Alert.module.css";

interface AlertProps {
  type?: "success" | "error";
}

export default function Alert({ type }: AlertProps) {
  return (
    <p className={clsx(css.alert, type && css[type])}>
      This is a default alert text
    </p>
  );
}

/* ----------------------------------------------
/* 2.10.3 - Стилізація компонентів / CSS-модулі
/* ----------------------------------------------*/
// css – це об’єкт, який містить відповідності:{ alert: "Alert_alert__a9e71" }
// css.alert – ми використовуємо ім’я класу так, ніби звертаємось до властивості об'єкта
/* ----------------------------------------------*/
// Це зручно, бо:
// -------------------
// Стилі компонента ізольовані.
// Можна використовувати однакові імена класів у різних компонентах без конфліктів.
// Всі переваги звичайного CSS доступні – медіазапити, псевдокласи, змінні тощо.
/* ----------------------------------------------*/
// import css from "./Alert.module.css";
// export default function Alert() {
//   return <p className={css.alert}>This is alert text</p>;
// }

/* ----------------------------------------------
/* 2.10.2 - Стилізація компонентів / import Ванільний CSS
/* ----------------------------------------------
/* Можна винести стилі в окремий .css файл та підключити його в компоненті. Хорошою практикою буде писати CSS тільки для HTML-розмітки компонента до якого належить цей файл стилів. 
/* Стилі компонента імпортуються у файл оголошення компонента. У React HTML-атрибуту class відповідає JSX-атрибут className (Alert.tsx). 
/* ----------------------------------------------*/
// У великих проєктах ванільний CSS і inline-стилі швидко втрачають ефективність. Тому далі ми будемо працювати з CSS-модулями – сучасним і зручним способом стилізації компонентів.
/* ----------------------------------------------*/

// import "./Alert.css";

// export default function Alert() {
//   return <p className="alert">This is alert text</p>;
// }
