// -----------------------------------------------
// ---- 2.13.1 Повторне використання стилів ------
// -----------------------------------------------
// Вам потрібно встановити пакет clsx за допомогою вашого пакетного менеджера.Відкрийте термінал у кореневій папці проєкту та виконайте одну з команд (залежно від того, що ви використовуєте):
// •	Якщо використовуєте npm:
// npm install clsx
// ---------
//У React немає глобальних CSS-класів, які можна застосовувати в будь-якому компоненті. Кожен компонент має локальні стилі, завдяки CSS-модулям.
// Щоб не дублювати стилі, ми виносимо спільний стиль у окремий компонент і використовуємо його там, де потрібно.
// Наприклад, замість того щоб писати один і той самий клас .button у різних місцях, ми створимо універсальний компонент <Button> і будемо використовувати його.
// ----------------------------------------------

import clsx from "clsx";
import css from "./Button.module.css";

interface ButtonProps {
  variant?: "primary" | "secondary";
  text: string;
}

export default function Button({ variant, text }: ButtonProps) {
  return (
    <button className={clsx(css.button, variant && css[variant])}>
      {text}
    </button>
  );
}
