// ----------------------------------------------
// 2.5.4 - Властивості компонента/ Деструктуризація props
// ----------------------------------------------
// Оскільки props – це об'єкт, ми можемо деструктурувати його у сигнатурі функції. Це робить код чистішим і читабельнішим.
//
// Ми створили компонент, який налаштовується і який можна використовувати для відображення товарів. Ми передаємо йому дані як пропси, а у відповідь отримуємо дерево React-елементів із підставленими значеннями.
// ----------------------------------------------

interface ProductProps {
  name: string;
  imgUrl: string;
  price: number;
}

export default function Product({ name, imgUrl, price }: ProductProps) {
  return (
    <div>
      <img src={imgUrl} alt={name} width="480" />
      <h2>{name}</h2>
      <p>Price: {price} credits</p>
    </div>
  );
}

// ----------------------------------------------
// 2.5.3 - Властивості компонента/ Декілька props
// ----------------------------------------------
// Компонент може приймати скільки завгодно пропсів – усе залежить від вашого задуму. Додамо до Product зображення (imgUrl) та ціну (price)
// ----------------------------------------------
// interface ProductProps {
//   name: string;
//   imgUrl: string;
//   price: number;
// }

// export default function Product(props: ProductProps) {
//   return (
//     <div>
//       <h2>{props.name}</h2>
//       <img src={props.imgUrl} alt={props.name} width="320" />
//       <p>Price: {props.price} credits</p>
//     </div>
//   );
// }

// ----------------------------------------------
// 2.4.1 - Компоненти / Створення окремого компонента
// ----------------------------------------------
// Рекомендовано, щоб ім’я файлу компонента (Product.tsx) збігалося з назвою самого компонента (Product). Це поширена практика, яка допомагає краще орієнтуватися у проєкті. Тепер ви можете імпортувати Product у файлі App.tsx і використовувати його як будь-який JSX-елемент
// ----------------------------------------------
// Оскільки компонент є головною сутністю файлу, ми використовуємо export default. У майбутньому, якщо в одному файлі буде кілька елементів (наприклад, компонент і утиліти), можна використовувати іменований експорт (export const). Але для компонентів ми домовляємося використовувати export default.
// ----------------------------------------------
// 2.5.1 - Властивості компонента, Типізація props
// ----------------------------------------------
// Компоненти у React можуть приймати зовнішні властивості – їх ще називають props (від properties). Це дозволяє налаштовувати компонент і робити його багаторазовим. Без props компонент завжди повертає одну й ту саму розмітку. React автоматично передає всі props у вигляді об'єкта, який доступний у компоненті як перший аргумент функції.
// У TypeScript кожен компонент має явно описати типи пропсів, які він приймає. Для цього використовується interface або type. Ми будемо використовувати саме interface.
// ----------------------------------------------

// interface ProductProps {
//   name: string;
// }

// export default function Product(props: ProductProps) {
//   return (
//     <div>
//       <h2>{props.name}</h2>
//       <p>Price: 999 credits</p>
//     </div>
//   );
// }
